#jdbc
jdbc.id=twoapes
jdbc.sid=null
jdbc.host=127.0.0.1
jdbc.username=twoapes
jdbc.password=1
jdbc.port=1521
jdbc.type=ORACLE
jdbc.chars=UTF-8
jdbc.speed=10485760
jdbc.dataType=yyyy-MM-dd
jdbc.isCo=false
#mongodb
mongodb.host=127.0.0.1
mongodb.port=22
mongodb.databaseName=twoapes
mongodb.username=twoapes
mongodb.source=twoapes
mongodb.password=1
#sftp
sftp.host=127.0.0.1
sftp.userName=root
sftp.password=QQqq1234.
sftp.port=22
sftp.privateKey=null
#name
name.name1=\u8d75\u94b1\u5b59\u674e\u5468\u5434\u90d1\u738b\u51af\u9648\u891a\u536b\u848b\u6c88\u97e9\u6768\u6731\u79e6\u5c24\u8bb8\u4f55\u5415\u65bd\u5f20\u5b54\u66f9\u4e25\u534e\u91d1\u9b4f\u9676\u59dc\u621a\u8c22\u90b9\u55bb\u67cf\u6c34\u7aa6\u7ae0\u4e91\u82cf\u6f58\u845b\u595a\u8303\u5f6d\u90ce\u9c81\u97e6\u660c\u9a6c\u82d7\u51e4\u82b1\u65b9\u4fde\u4efb\u8881\u67f3\u9146\u9c8d\u53f2\u5510\u8d39\u5ec9\u5c91\u859b\u96f7\u8d3a\u502a\u6c64\u6ed5\u6bb7\u7f57\u6bd5\u90dd\u90ac\u5b89\u5e38\u4e50\u4e8e\u65f6\u5085\u76ae\u535e\u9f50\u5eb7\u4f0d\u4f59\u5143\u5168\u851a\u6613\u535c\u5b5f\u548c\u4ec7\u8363\u51b7\u4faf\u5b93\u5b8b\u8305\u5e9e\u718a\u7eaa\u8212\u5c48\u9879\u795d\u8463\u6881\u675c\u962e\u84dd\u95f5\u5e2d\u5b63\u9ebb\u5f3a\u8d3e\u8def\u5a04\u5371\u6c5f\u7ae5\u989c\u90ed\u6885\u76db\u6797\u5201\u949f\u5f90\u90b1\u9a86\u9ad8\u590f\u8521\u7530\u6a0a\u80e1\u51cc\u970d\u865e\u4e07\u652f\u67ef\u661d\u7ba1\u5362\u83ab\u7ecf\u623f\u88d8\u7f2a\u5e72\u89e3\u5e94\u5b97\u5ba3\u4e01\u8d32\u9093\u90c1\u5355\u676d\u6d2a\u5305\u8bf8\u5de6\u77f3\u5d14\u5409\u94ae\u9f9a\u7a0b\u5d47\u90a2\u6ed1\u88f4\u9646\u8340\u60e0\u7504\u66f2\u5bb6\u5c01\u82ae\u7fbf\u50a8\u9773\u6c72\u90b4\u7cdc\u677e\u4e95\u6bb5\u5bcc\u5deb\u4e4c\u7126\u5df4\u5f13\u7267\u9697\u5c71\u8c37\u8f66\u4faf\u5b93\u84ec\u5168\u90d7\u73ed\u4ef0\u79cb\u4ef2\u4f0a\u5bab\u5b81\u4ec7\u683e\u66b4\u7518\u94ad\u5386\u620e\u7956\u6b66\u7b26\u5218\u666f\u8a79\u675f\u9f99\u53f6\u5e78\u53f8\u97f6\u90dc\u9ece\u84df\u8584\u5370\u5bbf\u767d\u6000\u84b2\u90b0\u4ece\u4e1b\u9102\u7d22\u54b8\u7c4d\u8d56\u5353\u853a\u5c60\u8499\u6c60\u4e54\u9633\u90c1\u80e5\u80fd\u82cd\u53cc\u95fb\u8398\u515a\u7fdf\u8c2d\u8d21\u52b3\u9004\u59ec\u7533\u6276\u5835\u5189\u5bb0\u90e6\u96cd\u8204\u74a9\u6851\u6842\u6fee\u725b\u5bff\u901a\u8fb9\u6248\u71d5\u5180\u90cf\u6d66\u5c1a\u519c\u6e29\u522b\u5e84\u664f\u67f4\u77bf\u960e\u5145\u6155\u8fde\u8339\u4e60\u5ba6\u827e\u9c7c\u5bb9\u5411\u53e4\u6613\u614e\u6208\u5ed6\u5ebe\u7ec8\u66a8\u5c45\u8861\u6b65\u90fd\u803f\u6ee1\u5f18\u5321\u56fd\u6587\u5bc7\u5e7f\u7984\u9619\u4e1c\u6bb4\u6bb3\u6c83\u5229\u851a\u8d8a\u5914\u9686\u5e08\u5de9\u538d\u8042\u6641\u52fe\u6556\u878d\u51b7\u8a3e\u8f9b\u961a\u90a3\u7b80\u9976\u7a7a\u66fe\u6bcb\u6c99\u4e5c\u517b\u97a0\u987b\u4e30\u5de2\u5173\u84af\u76f8\u67e5\u540e\u8346\u7ea2\u6e38\u7afa\u6743\u902e\u76cd\u76ca\u6853\u516c\u95eb\u6cd5\u6c5d\u9122\u6d82\u94a6\u798f\u8a00\u695a\u664b
name.name2=\u4e07\u4fdf\u53f8\u9a6c\u4e0a\u5b98\u6b27\u9633\u590f\u4faf\u8bf8\u845b\u95fb\u4eba\u4e1c\u65b9\u8d6b\u8fde\u7687\u752b\u5c09\u8fdf\u516c\u7f8a\u6fb9\u53f0\u516c\u6cbb\u5b97\u653f\u6fee\u9633\u6df3\u4e8e\u5355\u4e8e\u592a\u53d4\u7533\u5c60\u516c\u5b59\u4e50\u6b63\u8f69\u8f95\u4ee4\u72d0\u949f\u79bb\u5b87\u6587\u957f\u5b59\u6155\u5bb9\u9c9c\u4e8e\u95fe\u4e18\u53f8\u5f92\u53f8\u7a7a\u4e93\u5b98\u53f8\u5bc7\u4ec9\u7763\u5b50\u8f66\u989b\u5b59\u7aef\u6728\u5deb\u9a6c\u516c\u897f\u6f06\u96d5\u4e50\u6b63\u58e4\u9a77\u516c\u826f\u62d3\u8dcb\u5939\u8c37\u5bb0\u7236\u8c37\u6881\u6bb5\u5e72\u767e\u91cc\u4e1c\u90ed\u5357\u95e8\u547c\u5ef6\u7f8a\u820c\u5fae\u751f\u6881\u4e18\u5de6\u4e18\u4e1c\u95e8\u897f\u95e8\u5357\u5bab\u7b2c\u4e94
name.ming=\u5b89\u6602\u5df4\u67cf\u767d\u534a\u5317\u8d1d\u672c\u5f7c\u78a7\u5f3c\u5bbe\u5e76\u70b3\u6ce2\u4f2f\u535a\u4e0d\u5e03\u91c7\u707f\u82cd\u66f9\u7b56\u5c91\u5c18\u6668\u6210\u627f\u8fdf\u6301\u8d64\u521d\u695a\u6625\u4ece\u7fe0\u8fbe\u4ee3\u5927\u4e39\u5f53\u9053\u5f97\u5fb7\u767b\u8fea\u6566\u4fc4\u5c14\u65b9\u975e\u98de\u51e4\u65b9\u5b5a\u5bcc\u798f\u592b\u7b26\u4ed8\u752b\u560e\u76d6\u5e72\u8d63\u521a\u9ad8\u6208\u6b4c\u683c\u5f13\u516c\u8c37\u5149\u5e7f\u8d35\u8d2f\u89c2\u51a0\u56fd\u679c\u8fc7\u6d77\u51fd\u5bd2\u6c49\u884c\u85b0\u676d\u6c86\u8c6a\u660a\u6d69\u53f7\u6d69\u7693\u79be\u7ea2\u6d2a\u5b8f\u8679\u539a\u9e44\u9a6c\u534e\u5316\u73af\u6d51\u60e0\u4f1a\u5409\u57fa\u6280\u5b63\u6d4e\u7ee7\u5180\u5609\u7532\u575a\u5251\u5065\u6c5f\u59dc\u6770\u754c\u4ecb\u7586\u4e5d\u9152\u5177\u4fca\u770b\u5eb7\u53ef\u514b\u7a7a\u5b54\u9cb2\u6765\u8d56\u83b1\u6f9c\u5c9a\u84dd\u6717\u4e50\u96f7\u78ca\u51b7\u529b\u7acb\u793c\u5229\u8fde\u826f\u4eae\u6797\u9716\u9e9f\u7075\u5cad\u9f99\u73d1\u8def\u7984\u9732\u5f8b\u9e7f\u9e3e\u7565\u7f57\u87ba\u6d1b\u9ebb\u9a6c\u6ee1\u832b\u8499\u68a6\u5b5f\u660e\u9e23\u94ed\u6728\u7267\u7a46\u90a3\u5948\u5357\u7537\u8bb7\u5c3c\u5e74\u9e1f\u725b\u519c\u5f29\u6012\u6696\u6cee\u6500\u76d8\u57f9\u6c9b\u4f69\u5f6d\u670b\u9e4f\u5c4f\u5e73\u6cfc\u90eb\u84b2\u6fee\u6d66\u749e\u5703\u5947\u4e5e\u542f\u5343\u6f5c\u524d\u94b1\u4e7e\u5f3a\u5e86\u7fa4\u5168\u6cc9\u6743\u8343\u5d58\u5982\u8339\u854a\u745e\u777f\u5c71\u4e0a\u5546\u88f3\u5c1a\u7ecd\u793e\u8398\u5ba3\u58eb\u4e16\u5e08\u8bd7\u65f6\u4ec0\u89c6\u5b88\u53d4\u4e66\u672f\u53cc\u6c34\u987a\u601d\u65af\u677e\u5d69\u5b8b\u9882\u5bbf\u7d20\u5c81\u788e\u968f\u9042\u5854\u53f0\u6cf0\u592a\u5802\u6d9b\u7279\u817e\u6ed5\u5929\u7530\u606c\u8214\u94c1\u901a\u540c\u7b52\u5f64\u6850\u7ae5\u5b9b\u4e07\u65fa\u671b\u5dcd\u5fae\u8587\u536b\u672a\u6e2d\u7eb9\u95fb\u6587\u6211\u5367\u63e1\u4e4c\u65e0\u4f0d\u5348\u6b66\u8fd5\u5434\u4e94\u52a1\u4e60\u7199\u559c\u4ed9\u5148\u9730\u76f8\u9999\u7965\u6e58\u5411\u6821\u6653\u5b5d\u7b11\u8f9b\u5fc3\u65b0\u4fe1\u5174\u661f\u884c\u964d\u50cf\u6d88\u9704\u5b5f\u8427\u6653\u5c0f\u534f\u978b\u6cc4\u8c22\u5fc3\u661f\u79c0\u7eed\u65ed\u7d6e\u8f69\u9009\u5b66\u70ab\u96ea\u884d\u5f66\u989c\u5ef6\u8a00\u989c\u598d\u5ca9\u708e\u626c\u9633\u6768\u7476\u8000\u53f6\u60a6\u5b9c\u6021\u4e49\u6613\u827a\u4ea6\u5f08\u7fbf\u5b87\u8c6b\u5143\u8fdc\u8574\u6600\u4e91\u8fd0\u97f5\u6795\u9707\u9547\u6b63\u94ee\u4e4b\u829d\u6cbb\u4e2d\u5468\u5b99\u663c\u821f\u73e0\u7af9\u7b51\u4e3b\u9a7b\u8bf8\u6731\u70db\u7afa\u716e\u67f1\u51c6\u5353\u59ff\u7d2b\u81ea\u5b97\u90b9\u8d70\u7956\u5c0a\u5de6\u4f50\u4f5c\u5634\u7956\u5de6\u4f50

