package other;

import lombok.extern.slf4j.Slf4j;
import org.junit.Test;

/**
 * @author add by huyingzhao
 * 2023-02-07 22:14
 */
@Slf4j

public class NameTest {
    /**
     * virtual crate a user information
     * include age,sex,name ... something
     */
    @Test
    public void nameTest() {
        String[] name = getName();

        int nameLength = 2; // 指定名字长度为2
        for (String full  : name) {
            String ming = getFullName(nameLength);
            System.out.println(full  + ming);
        }

        nameLength = 3; // 指定名字长度为3
        for (String full  : name) {
            String ming = getFullName(nameLength);
            System.out.println(full  + ming);
        }
    }

    private String[] getName() {
        return new String[]{"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
                "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
                "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏",
                "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
                "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
                "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
                "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
                "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
                "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余",
                "元", "全", "蔚", "易", "卜", "孟", "和", "仇", "荣", "冷",
                "侯", "宓", "宋", "茅", "庞", "熊", "纪", "舒", "屈", "项",
                "祝", "董", "梁", "杜", "阮", "蓝", "闵", "席", "季", "麻",
                "强", "贾", "路", "娄", "危", "江", "童", "颜", "郭", "梅",
                "盛", "林", "刁", "钟", "徐", "邱", "骆", "高", "夏", "蔡",
                "田", "樊", "胡", "凌", "霍", "虞", "万", "支", "柯", "昝",
                "管", "卢", "莫", "经", "房", "裘", "缪", "干", "解", "应",
                "宗", "宣", "丁", "贲", "邓", "郁", "单", "杭", "洪", "包",
                "诸", "左", "石", "崔", "吉", "钮", "龚", "程", "嵇", "邢",
                "滑", "裴", "陆", "荀", "惠", "甄", "曲", "家", "封", "芮",
                "羿", "储", "靳", "汲", "邴", "糜", "松", "井", "段", "富",
                "巫", "乌", "焦", "巴", "弓", "牧", "隗", "山", "谷", "车",
                "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲", "伊",
                "宫", "宁", "仇", "栾", "暴", "甘", "钭", "历", "戎", "祖",
                "武", "符", "刘", "景", "詹", "束", "龙", "叶", "幸", "司",
                "韶", "郜", "黎", "蓟", "薄", "印", "宿", "白", "怀", "蒲",
                "邰", "从", "丛", "鄂", "索", "咸", "籍", "赖", "卓", "蔺",
                "屠", "蒙", "池", "乔", "阳", "郁", "胥", "能", "苍", "双",
                "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬", "申",
                "扶", "堵", "冉", "宰", "郦", "雍", "舄", "璩", "桑", "桂",
                "濮", "牛", "寿", "通", "边", "扈", "燕", "冀", "郏", "浦",
                "尚", "农", "温", "别", "庄", "晏", "柴", "瞿", "阎", "充",
                "慕", "连", "茹", "习", "宦", "艾", "鱼", "容", "向", "古",
                "易", "慎", "戈", "廖", "庾", "终", "暨", "居", "衡", "步",
                "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广", "禄",
                "阙", "东", "殴", "殳", "沃", "利", "蔚", "越", "夔", "隆",
                "师", "巩", "厍", "聂", "晁", "勾", "敖", "融", "冷", "訾",
                "辛", "阚", "那", "简", "饶", "空", "曾", "毋", "沙", "乜",
                "养", "鞠", "须", "丰", "巢", "关", "蒯", "相", "查", "后",
                "荆", "红", "游", "竺", "权", "逮", "盍", "益", "桓", "公",
                "万俟", "司马", "上官", "欧阳", "夏侯", "诸葛", "闻人", "东方", "赫连", "皇甫",
                "尉迟", "公羊", "澹台", "公治", "宗政", "濮阳", "淳于", "单于", "太叔", "申屠",
                "公孙", "乐正", "轩辕", "令狐", "钟离", "宇文", "长孙", "慕容", "鲜于", "闾丘",
                "司徒", "司空", "亓官", "司寇", "仉督", "子车", "颛孙", "端木", "巫马", "公西",
                "漆雕", "乐正", "壤驷", "公良", "拓跋", "夹谷", "宰父", "谷梁", "楚", "晋",
                "闫", "法", "汝", "鄢", "涂", "钦", "段干", "百里", "东郭", "南门",
                "呼延", "羊舌", "微生", "梁丘", "左丘", "东门", "西门", "南宫", "第五", "言",
                "福"};
    }

    private String getMing(int length) {
        final String[] chars = {"安", "昂", "巴", "柏", "白", "半", "北", "贝", "本", "彼", "碧", "弼", "宾",
                "并", "炳", "波", "伯", "博", "不", "布", "采", "灿", "苍", "曹", "策", "岑",
                "尘", "晨", "成", "承", "迟", "持", "赤", "初", "楚", "春", "从", "翠", "达",
                "代", "大", "丹", "当", "道", "得", "德", "登", "迪", "敦", "俄", "尔",
                "方", "非", "飞", "凤", "方", "孚", "富", "福", "夫", "符", "付", "甫",
                "嘎", "盖", "干", "赣", "刚", "高", "戈", "歌", "格", "弓", "公", "谷",
                "光", "广", "贵", "贯", "观", "冠", "国", "果", "过", "海", "函", "寒",
                "汉", "行", "薰", "杭", "沆", "豪", "昊", "浩", "号", "浩", "皓", "禾",
                "红", "洪", "宏", "虹", "厚", "鹄", "马", "华", "化", "环", "浑", "惠",
                "会", "吉", "基", "技", "季", "济", "继", "冀", "嘉", "甲", "坚", "剑",
                "健", "江", "姜", "杰", "界", "介", "疆", "九", "酒", "具", "俊", "看",
                "康", "可", "克", "空", "孔", "鲲", "来", "赖", "莱", "澜", "岚", "蓝",
                "朗", "乐", "雷", "磊", "冷", "力", "立", "礼", "利", "连", "良", "亮",
                "林", "霖", "麟", "灵", "岭", "龙", "珑", "路", "禄", "露", "律", "鹿",
                "鸾", "略", "罗", "螺", "洛", "麻", "马", "满", "茫", "蒙", "梦", "孟",
                "明", "鸣", "铭", "木", "牧", "穆", "那", "奈", "南", "男", "讷", "尼",
                "年", "鸟", "牛", "农", "弩", "怒", "暖", "泮", "攀", "盘", "培", "沛",
                "佩", "彭", "朋", "鹏", "屏", "平", "泼", "郫", "蒲", "濮", "浦", "璞",
                "圃", "奇", "乞", "启", "千", "潜", "前", "钱", "乾", "强", "庆", "群",
                "全", "泉", "权", "荃", "嵘", "如", "茹", "蕊", "瑞", "睿", "山", "上",
                "商", "裳", "尚", "绍", "社", "莘", "宣", "士", "世", "师", "诗", "时",
                "什", "视", "守", "叔", "书", "术", "双", "水", "顺", "思", "斯", "松",
                "嵩", "宋", "颂", "宿", "素", "岁", "碎", "随", "遂", "塔", "台", "泰",
                "太", "堂", "涛", "特", "腾", "滕", "天", "田", "恬", "舔", "铁", "通",
                "同", "筒", "彤", "桐", "童", "宛", "万", "旺", "望", "巍", "微", "薇",
                "卫", "未", "渭", "纹", "闻", "文", "我", "卧", "握", "乌", "无", "伍",
                "午", "武", "迕", "吴", "五", "务", "习", "熙", "喜", "仙", "先", "霰",
                "相", "香", "祥", "湘", "向", "校", "晓", "孝", "笑", "辛", "心", "新",
                "信", "兴", "星", "行", "降", "像", "消", "霄", "孟", "萧", "晓", "小",
                "协", "鞋", "泄", "谢", "心", "星", "秀", "续", "旭", "絮", "轩", "选",
                "学", "炫", "雪", "衍", "彦", "颜", "延", "言", "颜", "妍", "岩", "炎",
                "扬", "阳", "杨", "瑶", "耀", "叶", "悦", "宜", "怡", "义", "易", "艺",
                "亦", "弈", "羿", "宇", "豫", "元", "远", "蕴", "昀", "云", "运", "韵",
                "枕", "震", "镇", "正", "铮", "之", "芝", "治", "中", "周", "宙", "昼",
                "舟", "珠", "竹", "筑", "主", "驻", "诸", "朱", "烛", "竺", "煮", "柱",
                "准", "卓", "姿", "紫", "自", "宗", "邹", "走", "祖", "尊", "左", "佐",
                "作", "嘴", "祖", "左", "佐"};
        StringBuilder sb = new StringBuilder();
        for (int i = 0; i < length; i++) {
            sb.append(chars[(int) (Math.random() * chars.length)]);
        }
        return sb.toString();
    }

    private String getFullName(int length) {
        return getMing(length);
    }
}
